In [5]:
import pandas as pd

friends = [{'age': 15, 'job' : 'student'},
           {'age': 25, 'job' : 'developer'},
           {'age': 30, 'job' : 'teacher'}]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [6]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [7]:
df.drop(['John', 'Nate']) #drop은 삭제, 하지만 원df가 사라지는 것은 아님

       age        job
Jenny   25  developer

In [8]:
df = df.drop(['John', 'Nate']) #이렇게 해야 저장

In [9]:
df

       age        job
Jenny   25  developer

In [10]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [11]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [12]:
df = df.drop(['John', 'Nate'], inplace = True) #inplace 하면 원래df에서 삭제

In [13]:
df

In [16]:
import pandas as pd

friends = [{'name' : 'John', 'age': 15, 'job' : 'student'},
           {'name' : 'Ben', 'age': 25, 'job' : 'developer'},
           {'name' : 'Jenny', 'age': 30, 'job' : 'teacher'}]

df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])
#인덱스를 지정하지 않았으므로 숫자가 나옴

In [17]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [22]:
df = df.drop(df.index[[0,2]]) #인덱스를 통한 제거
df

  name  age        job
1  Ben   25  developer

In [32]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [33]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [36]:
df = df[df.age > 20]

In [38]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [47]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [48]:
df = df.drop('age', axis=1)

In [49]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [51]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [52]:
df = df.drop('age', axis=1, inplace = True)

In [54]:
df